yh-sb/mcu-framework/src/hal/STM32F4/exti.cpp
#include <stddef.h>

#include "common/macros.h"

#include "hal/STM32F4/exti.hpp"
#include "hal/STM32F4/gpio.hpp"

#include "hal/STM32F4/CMSIS/device-support/include/stm32f4xx.h"
#include "hal/STM32F4/CMSIS/core-support/core_cm4.h"

using namespace hal;

#define EXTI_IRQ_PRIORITY 3
#define GPIO_AF_15_EVENTOUT 0x0F

static IRQn_Type const irq_list[PIN_QTY] =
{
	EXTI0_IRQn, EXTI1_IRQn, EXTI2_IRQn,
	EXTI3_IRQn, EXTI4_IRQn, EXTI9_5_IRQn,
	EXTI9_5_IRQn, EXTI9_5_IRQn, EXTI9_5_IRQn,
	EXTI9_5_IRQn, EXTI15_10_IRQn, EXTI15_10_IRQn,
	EXTI15_10_IRQn, EXTI15_10_IRQn, EXTI15_10_IRQn,
	EXTI15_10_IRQn
};

static GPIO_TypeDef *const gpio_list[PORT_QTY] =
{
	GPIOA, GPIOB, GPIOC,
#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F405xx) || \
	defined(STM32F407xx) || defined(STM32F411xE) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
	GPIOD, GPIOE,
#else
	NULL, NULL,
#endif
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
	GPIOF, GPIOG,
#else
	NULL, NULL,
#endif
	GPIOH,
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || \
	defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || \
	defined(STM32F479xx)
	GPIOI,
#else
	NULL,
#endif
#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
	GPIOJ, GPIOK
#else
	NULL, NULL
#endif
};

static uint32_t const port_list[PORT_QTY] =
{
	SYSCFG_EXTICR1_EXTI0_PA, SYSCFG_EXTICR1_EXTI0_PB, SYSCFG_EXTICR1_EXTI0_PC,
#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F405xx) || \
	defined(STM32F407xx) || defined(STM32F411xE) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
	SYSCFG_EXTICR1_EXTI0_PD, SYSCFG_EXTICR1_EXTI0_PE,
#else
	0, 0,
#endif
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F412Cx) || \
	defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || \
	defined(STM32F413xx) || defined(STM32F415xx) || defined(STM32F417xx) || \
	defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
	defined(STM32F469xx) || defined(STM32F479xx)
	SYSCFG_EXTICR1_EXTI0_PF, SYSCFG_EXTICR1_EXTI0_PG,
#else
	0, 0,
#endif
	SYSCFG_EXTICR1_EXTI0_PH,
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || \
	defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F429xx) || \
	defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || \
	defined(STM32F479xx)
	SYSCFG_EXTICR1_EXTI0_PI,
#else
	0,
#endif
#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || \
	defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
	SYSCFG_EXTICR1_EXTI0_PJ, SYSCFG_EXTICR1_EXTI0_PK
#else
	0, 0
#endif
};

static uint8_t const src_offset_list[PIN_QTY] =
{
	0, 4, 8,
	0, 4, 8,
	0, 4, 8,
	0, 4, 8,
};

static exti *obj_list[PIN_QTY];

static void gpio_af_init(gpio &gpio);

exti::exti(gpio &gpio, exti_trigger_t trigger):
	_gpio(gpio),
	_trigger(trigger),
	_ctx(NULL),
	_cb(NULL)
{
	ASSERT(_gpio.mode() == GPIO_MODE_DI);
	
	gpio_af_init(_gpio);
	
	/* Enable clock */
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
	
	/* Setup EXTI line source */
	uint8_t pin = _gpio.pin();
	uint8_t exti_src = src_offset_list[pin];
	SYSCFG->EXTICR[pin / 2] &= ~(0x0F << exti_src);
	SYSCFG->EXTICR[pin / 2] |= port_list[_gpio.port()] << exti_src;
	
	uint32_t line_bit = 1 << pin;
	/* Setup EXTI mask regs */
	EXTI->EMR &= ~line_bit;
	EXTI->IMR &= ~line_bit;
	
	/* Setup EXTI trigger */
	EXTI->RTSR &= ~line_bit;
	EXTI->FTSR &= ~line_bit;
	if(_trigger == EXTI_TRIGGER_RISING)
		EXTI->RTSR |= line_bit;
	else if(_trigger == EXTI_TRIGGER_FALLING)
		EXTI->FTSR |= line_bit;
	else
	{
		EXTI->RTSR |= line_bit;
		EXTI->FTSR |= line_bit;
	}
	
	obj_list[pin] = this;
	
	NVIC_ClearPendingIRQ(irq_list[pin]);
	NVIC_SetPriority(irq_list[pin], EXTI_IRQ_PRIORITY);
	NVIC_EnableIRQ(irq_list[pin]);
}

exti::~exti()
{
	
}

void exti::on(exti_cb_t cb, void *ctx)
{
	ASSERT(cb);
	
	_cb = cb;
	_ctx = ctx;
	
	uint8_t pin = _gpio.pin();
	uint32_t line_bit = 1 << pin;
	/* Clear EXTI line pending bits */
	EXTI->PR |= line_bit;
	/* Setup EXTI line configuration */
	EXTI->IMR |= line_bit;
	
	NVIC_ClearPendingIRQ(irq_list[pin]);
}

void exti::off()
{
	_cb = NULL;
	_ctx = NULL;
	/* Clear EXTI line configuration */
	EXTI->IMR &= ~(1 << _gpio.pin());
}

void exti::trigger(exti_trigger_t trigger)
{
	_trigger = trigger;
	uint32_t line_bit = 1 << _gpio.pin();
	if(_trigger == EXTI_TRIGGER_RISING)
		EXTI->RTSR |= line_bit;
	else if(_trigger == EXTI_TRIGGER_FALLING)
		EXTI->FTSR |= line_bit;
	else
	{
		EXTI->RTSR |= line_bit;
		EXTI->FTSR |= line_bit;
	}
}

static void gpio_af_init(gpio &gpio)
{
	GPIO_TypeDef *gpio_reg = gpio_list[gpio.port()];
	
	uint8_t pin = gpio.pin();
	if(pin < 8)
	{
		gpio_reg->AFR[0] &= ~(0x0F << (pin * 4));
		gpio_reg->AFR[0] |= GPIO_AF_15_EVENTOUT << (pin * 4);
	}
	else
	{
		gpio_reg->AFR[1] &= ~(0x0F << ((pin - 8) * 4));
		gpio_reg->AFR[1] |= GPIO_AF_15_EVENTOUT << ((pin - 8) * 4);
	}
}

extern "C" void exti_irq_hndlr(hal::exti *obj)
{
	/* Clear EXTI line pending bits */
	EXTI->PR = 1 << obj->_gpio.pin();
	
	if(obj->_cb)
		obj->_cb(obj, obj->_ctx);
}

extern "C" void EXTI0_IRQHandler(void)
{
	exti_irq_hndlr(obj_list[0]);
}

extern "C" void EXTI1_IRQHandler(void)
{
	exti_irq_hndlr(obj_list[1]);
}

extern "C" void EXTI2_IRQHandler(void)
{
	exti_irq_hndlr(obj_list[2]);
}

extern "C" void EXTI3_IRQHandler(void)
{
	exti_irq_hndlr(obj_list[3]);
}

extern "C" void EXTI4_IRQHandler(void)
{
	exti_irq_hndlr(obj_list[4]);
}

extern "C" void EXTI9_5_IRQHandler(void)
{
	uint32_t pending_bit = EXTI->PR;
	uint32_t line_bit = (1 << 5);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[5]);
		return;
	}
	
	line_bit = (1 << 6);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[6]);
		return;
	}
	
	line_bit = (1 << 7);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[7]);
		return;
	}
	
	line_bit = (1 << 8);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[8]);
		return;
	}
	
	line_bit = (1 << 9);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[9]);
		return;
	}
}

extern "C" void EXTI15_10_IRQHandler(void)
{
	uint32_t pending_bit = EXTI->PR;
	
	uint32_t line_bit = (1 << 10);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[10]);
		return;
	}
	
	line_bit = (1 << 11);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[11]);
		return;
	}
	
	line_bit = (1 << 12);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[12]);
		return;
	}
	
	line_bit = (1 << 13);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[14]);
		return;
	}
	
	line_bit = (1 << 14);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[14]);
		return;
	}
	
	line_bit = (1 << 15);
	if(pending_bit & line_bit)
	{
		exti_irq_hndlr(obj_list[15]);
		return;
	}
}
